; domain
(define (domain submersible)
(:requirements :typing)
(:types deck diver)

(:predicates
    (embarks_at ?person - diver ?floor - deck)
    (disembarks_at ?person - diver ?floor - deck)
    (shallower_than ?floor1 - deck ?floor2 - deck)
    (submerged ?person - diver)
    (delivered ?person - diver)
    (pod-at ?floor - deck))

(:action pressurize
    :parameters (?f - deck ?p - diver)
    :precondition (and (pod-at ?f) (embarks_at ?p ?f))
    :effect (submerged ?p))

(:action egress
    :parameters (?f - deck ?p - diver)
    :precondition (and (pod-at ?f) (disembarks_at ?p ?f) (submerged ?p))
    :effect (and (not (submerged ?p))          (delivered ?p))) ;;drive up

(:action ascend
    :parameters (?f1 - deck ?f2 - deck)
    :precondition (and (pod-at ?f1) (shallower_than ?f1 ?f2))
    :effect (and (pod-at ?f2) (not (pod-at ?f1))))   ;;drive down

(:action descend
    :parameters (?f1 - deck ?f2 - deck)
    :precondition (and (pod-at ?f1) (shallower_than ?f2 ?f1))
    :effect (and (pod-at ?f2) (not (pod-at ?f1))))

)

; problem
(define (problem submersible-p05)
   (:domain submersible)
   (:objects diver0 diver1 diver2 - diver
             deck0 deck1 deck2 deck3 - deck)


(:init
(shallower_than deck0 deck1)
(shallower_than deck0 deck2)
(shallower_than deck0 deck3)

(shallower_than deck1 deck2)
(shallower_than deck1 deck3)

(shallower_than deck2 deck3)



(embarks_at diver0 deck1)
(disembarks_at diver0 deck2)

(embarks_at diver1 deck1)
(disembarks_at diver1 deck2)

(embarks_at diver2 deck1)
(disembarks_at diver2 deck3)






(pod-at deck0)
)


(:goal (and
(delivered diver0)
(delivered diver1)
(delivered diver2)
))
)

; plan
1. (ascend deck0 deck1)
   deleted: (pod-at deck0)
   added: (pod-at deck1)
   goals met: 0 of 3
2. (pressurize deck1 diver0)
   added: (submerged diver0)
   goals met: 0 of 3
3. (pressurize deck1 diver1)
   added: (submerged diver1)
   goals met: 0 of 3
4. (pressurize deck1 diver2)
   added: (submerged diver2)
   goals met: 0 of 3
5. (ascend deck1 deck2)
   deleted: (pod-at deck1)
   added: (pod-at deck2)
   goals met: 0 of 3
6. (egress deck2 diver1)
   deleted: (submerged diver1)
   added: (delivered diver1)
   goals met: 1 of 3
7. (egress deck2 diver0)
   deleted: (submerged diver0)
   added: (delivered diver0)
   goals met: 2 of 3
8. (ascend deck2 deck3)
   deleted: (pod-at deck2)
   added: (pod-at deck3)
   goals met: 2 of 3
9. (egress deck3 diver2)
   deleted: (submerged diver2)
   added: (delivered diver2)
   goals met: 3 of 3
